angle/kepson/attack10/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        tolerance       0.02;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

  pcorrFinal
    {
        $pcorr;
        tolerance       1e-06;
        relTol          0;
    }
    p
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
    UFinal
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
   "(U|k|epsilon)"
{
       solver PBiCG;
       preconditioner DILU;
       tolerance 1e-05;
       relTol 0.1;
}

     "(U|k|epsilon)Final"
{
       $U;
       tolerance 1e-05;
       relTol 0;
}
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    3;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
pRefCell 1001; 
pRefValue 0; 
}

relaxationFactors
{
fields
{
}
equations
{
"U.*" 1;
"k.*" 1;
"epsilon.*" 1;
}
}

// ************************************************************************* //
